[{"title":"If only one person..","text":"If only one person has stuck with me, had been there for me, had loved me as much as I loved them. I get it, I'm a little autistic and I struggle with mental health but the way I've been treated makes me feel like I'm worthless because of it.\n\nI'm not confident enough, or funny enough, or happy enough to deserve to be loved. I just wanted a friend. I've got a few but they're old friends who I don't see very often. I need someone to text me often, check up on me, wonder how I'm doing. I've been there for so many people, so many people I would've considered my closest friends but eventually they all leave.\n\nNo one matches my effort because I'm not worth it. I'm useless and cursed to be alone. No matter how hard i try. And it's not like I haven't given it my damnest. I've been trying hard for over half my life to find someone, anyone. But it's pointless. I'm the lowest I've been in a few years now. Been abused, manipulated, and taken advantage of but it doesn't matter. I'm a magnet for narcissists. And I have no one close to me now, no one to help me. I feel like such a lost cause. If only one person had been my friend.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/194ho1s\/if_only_one_person\/"},{"title":"I got banned from r\/incelexit for suggesting people don't engage in good faith?","text":"Here's what I posted. \n\n\"I feel like if I see an advice post on a specific situation, it is so common for people here to just automatically assume the poster is an unreliable narrator who didn't understand the situation and you from the other side of the screen know how things actually went down.\n\nLike if I say \"abc happened because of xyz\" the response is \"Actually xyz is false, what probably happened is def and you just misinterpreted it as xyz\" based on nothing other than the readers preconceived notions of incels.\n\nOr worse yet, every interaction is viewed in the worst lens. If I but a girl a drink, I \"am locking her in a situation where I feel like I am owed a conversation and she can't get out of it\". If I pursue an unattractive girl knowing damn well I am also unattractive \"I'm looking for a sex doll to fuck so I'm going after the girl who I'd think has the lowest standards because I want to use her to validation my masculinity and I feel entitled to her body because she's not conventionally attractive\".\n\nIt's like ever action has to be used in some way to justify me being single for a reason other than the way I look, and when I try to express confidence in my personality that cant possibly be true for some reason.\n\nWhy can't things be taken at face value?\"\n\n&#x200B;\n\nI don't understand how this is a bad thing to say or controversial, especially when it's a subreddit about helping people escape inceldom. Shouldn't it be encouraged to listen to the posters and not try to invalidate their experience?","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/193f6jg\/i_got_banned_from_rincelexit_for_suggesting\/"},{"title":"Should I just end it all","text":" weI’m probably not going to get any women to look at me as anything more than dirt on her shoe even if I do just work on myself and yeah I know there’s more to life than women but like according to any older person I’ve talked to it seems I’ve lived through the best years (I’m 19 now) so like the fucks point for me to keep going I’m mean absolutely nothing now and I’ll probably stay just as worthless for the rest of my I’m just that weird kid that people talk to because they feel bad and my family puts so much time and energy into me and I can’t understand why my sister is way more like to make them proud and amount to something I mean she going to Harvard for fucks sake I don’t even share their last name sence they’re my step family and I’m barely going into community college with no idea with what I’m gonna do with my life at this point my best bet is to eather just give up or just join the military and go die in whatever war they send me off to at least then people could say my life actually ment something \n\n\nTLDR:it’s just me whining and bitching to the internet\n\nI’m probably going to get cooked in the comments anyway ","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/191grvw\/should_i_just_end_it_all\/"},{"title":"This torment has no end. Only new beginnings","text":"I’m an empty void. People acknowledge that I exist. People trust me to do things for them.\nPeople ask me to help them.\n\nYet no matter what I do, no matter how they treat me, it’s never enough to fill the void that is my soul. I just tell myself it’s because I’ve never been loved, and no amount of self actualization changes that. \nBut I have a suspicion that even love won’t fix me. \nBecause I’m broken.\nNot like I’ll ever find out.\n\nI’m damaged goods, no one wants to love that. They’ll pity me. Say “oh I’m so sorry”. But then they’ll never talk to me ever again.\n\nBest friends, disappeared, gone, after I opened up to them. \n\n“Oh then they weren’t true friends” yeah NO ONE is and no one will be. \nDoesn’t matter how much I help.\nHow much I encourage.\nSupport\nCare for\nMake laugh\nSpend time with\nLove.\n\nPeople can’t love me. \n\n“Oh love yourself”\nI try. And I’m genuinely content in my life, but then my brain snaps out of the fever dream and decides it despises the boring basic life I live. It’s why I am writing this.\n\nIdk what I want, actually. I just want to feel like I’m not an invisible void in a world that hates me. \nI don’t want to feel fundamentally broken. Incapable of living in this world","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/191c0lz\/this_torment_has_no_end_only_new_beginnings\/"},{"title":"Zoloft Day 40\/41\/42 - new years resolutions? Tell me yours.","text":"I honestly need to change for the better this year. I haven't really sat down and wrote any goals. I'm thinking of doing it when I get off work. I'll probably just go to sleep though because I only got one hour. \nI was so drunk I don't even know how or why I was up so late. \n\nI'm feeling really motivated right now though and I suppose that's how every year starts. I know a new year doesn't really change anything but it's funny how it can switch up your mindset. \n\nI've honestly been doing a lot these past couple days. I'm realizing how much I can do now when I'm not just moping around feeling sorry for myself.\n\n1. I guess for now I really just want to focus on my finances.\n\n2. Getting my drivers license so I can get a car.\n\n3. Being a better person and working on my relationships. \n\n4. Brushing and showering regularly.\n\n5. Finding and focusing more on my hobbies.\n\n6. Continuing to read more. \n\nI'll probably switch up the order because #4 should probably be #1. 😂 It's just some ideas for goals though. I gotta plan the step now to accomplish them, but I feel these will greatly improve my mental health. I plan on taking my pills for a few more months.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18z2jtf\/zoloft_day_404142_new_years_resolutions_tell_me\/"},{"title":"I hate hearing reassuring life advice about how things are gonna get better because I use that as a cushion as to why I am not working harder to better myself.","text":" I dont deserve compassion or anything for myself because i rely too much on that. Things like \"its okay you're just too hard on yourself\", or \"It will get better soon dont worry\" are fucking bullshit because they provide a sense of security while i let myself get beat up by my problems, when in reality, the problems are only gonna be solved by my own actions. I feel that I read every reddit posts advice and am so self-aware of the fact that nothing will change unless i implement it. There is just one fucking problem... I DONT BRING MYSELF TO DO IT. I feel that I am in a vicious cycle of over-thinking, but i feel so compelled to believe that I need to do better and meet expectations for myself and everyone else. This is all because I know that if i dont, I know the regret I will feel after. Why are we made so flawed, I dont get it. I wish to just be stripped of my consciousness because my personal consciousness feels like hell on earth. I honestly can't even put my persistent thoughts into words because its all one blurry cloud that just eats at me. I hate myself so much... so fucking much. Sad part is that it doesnt feel like the kind of self-hate that induces the personal changes that I KNOW EXACTLY WHAT NEEDS TO BE DONE, rather it just eats at me and causes me to hate myself to the point where I dont feel like I deserve that supposed \"better self\". I have no discipline, no self-love and just run to cheap, quick dopamine hits to relieve the burdens that chop up my mental\n\nI just dont fucking know anymore. \n\n&#x200B;\n\nI just want the mind racing to fucking end... ","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18vivon\/i_hate_hearing_reassuring_life_advice_about_how\/"},{"title":"Zoloft Day 35\/36\/37\/38\/39 - 123123","text":"The end is here. I'm alone by choice. The end of the year is always rough. I declined a lot of invites to go out today. I feel like a total piece of shit but I would just be a downer if I went anywhere. It's best that I'm alone. \n\nUnlike everyone else I don't really have anything to celebrate. I peaked in October and then it was just a straight nose dive down. It's like I had hope poured into me again but it didn't matter because there was still a hole in me from before. \n\nThis week has been confusing and very disappointing. The time goes by so quick. I haven't gotten anything done that I wanted to.\n\nI'm probably in the darkest time of my life and I don't think anyone even notices or cares. There's really nothing anyone could do. \n\nLife sucks a lot... \n\nI don't know why I'm like this. I think I'm just not happy with where I am. I'm never happy with where I'm at though. And I don't really even know what I want. I feel trapped I guess. \n\nTrapped by my illnesses. Trapped by my family. Trapped by my job. Trapped by myself. \n\nI just want to feel free without the help of this bottle.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18vmgv5\/zoloft_day_3536373839_123123\/"},{"title":"I think I’m done","text":"Trigger warning: SH and S \nI’ve always had the looming thought. You know exactly which one I’m talking about. I think I’ve accepted the fact that if I ever follow through, I’ll be okay with it. I’m only 23 and I fully feel as if I’ve lived enough for me to able to leave and feel like I’ve left nothing behind. I’m not sure if it’s because I’ve grown numb to my emotions or if I’m really just on the verge of leaving it all behind. I feel so outcasted by the people that surround me yet I feel so suffocated by everything around me. Tonight I sat in my room thinking over this and I feel as if I’ve sealed my fate, when I’m gone just know that this was on my accord. Idk if it’s truly selfish for not wanting to exist but I do know that I have finally cracked under the pressure. Everything I put my efforts in feel like nothing anymore, the feeling of wanting to be cared for died long ago, and the thought of just not being around anymore truly feels like the most comforting feeling. Last year on New Years, I had a conversation with myself while experiencing the ego death from shrooms and I said that 2023 was going to be the difference making year. I did have my accomplishments but I realize that the lows only got heavier and heavier. I learned acceptance through heartbreak, I busted my ass to feel the best at what I do to have it ripped away from me in order to follow my heart, and I learned that the people who will stab you in the back wear the biggest smiles. So I leave this here to see if my 2024 will be worth it, if not I believe it will be my sign to leave this all behind and not having a second thought about it.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18nfbh6\/i_think_im_done\/"},{"title":"Day 26\/27\/28\/28 antidepressant progress.","text":"Last few days have been rough, but things are good. I've gotten a lot done and I feel like soon I'll be able to actually sit down and relax. \n\nMoneys been tight and I'm stressing about that. I'm honestly just so tired of calling people and dealing with them. I'm tired of waking up to go to work as well. Will I always be this unhappy?\n\nI had a whole breakdown on Saturday but can't really remember what was said because I was so drunk. \n\nI missed one of my doses yesterday because I overslept from drinking too much. My anxiety is so bad but I don't know if it's because of the missed dose or just how much pressure I'm putting on myself. \n\nIt's funny, ik I need to get sober but at the same time I'm thinking about which alcohol I'm going to buy tonight. \n\n\n\nOn another note I haven't really thought about my crush. She's still in my mind but my emotions haven't been that strong. I've been thinking more about my family. Maybe it's just because Christmas is coming up?\n\nI felt so bad yesterday though. I was telling myself I need to push everyone away, so I'm wondering if that's why I haven't really thought about my crush. I follow a mental health channel that I've found I can really relate to. She was saying a lot of stuff that I see in myself. \n\nIt made me feel pretty bad about myself. It wasn't the intention of her video to make me feel that way, but it just really made me see how many things I need to work on. It feels so overwhelming and hopeless sometimes. Well actually all the time. \n\nI hope I can get a lot done tonight but I'm feeling exhausted. If you made it to this part I hope you're feeling okay and everything is working out. Keep going.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18ljprt\/day_26272828_antidepressant_progress\/"},{"title":"Will anyone accept me?","text":"At this point, it's been months of me being alone, and the more time  goes on, the more I lose hope that there will be someone out there who  will love me for all the good, the bad, and the ugly, and that she would  be someone insanely beautiful to me and very sweet and loving. Like for months, I've just been crying alone in my home, feeling depressed that I  come home to nothing. I'm afraid no one would even like me because I am very awkward around people I am unfamiliar with and aren't good at  socializing due to conditions I was born with. I find it hard to connect  with others and have almost no friends (that sounds like a huge red flag). I hate being alone and having no one to share life despite how  everyone preaches it's the best thing ever and how relationships suck a lot and they're quite miserable being around this person who interferes  with your fun. I feel so unlovable, and all these things are the things  that others have said is unattractive to women. I just feel like I'm  some emasculated sorry excuse of a man for wanting someone to take care  of me, shower me with love, take me out, do things to make me happy and laugh, all because they love me more than anything. Even just expressing  all these makes me sound like some creepy incel and I'm afraid anything  I do will come off as creepy. Will anyone just accept me for who I am,  will anyone love me, am I just doomed to a life of loneliness because I can't man up?    ","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18kn1mj\/will_anyone_accept_me\/"},{"title":"Day 25 SSRI - Have people been speaking to me differently or is it all in my head?","text":"Each morning I look forward to taking my pill now. I'm hopeful that each one gets me one step closer to some type of normalcy. I’m quite aware of the risks SSRI’s pose but I’ve just gotten so bad. It’s like I’ve become addicted to this illness and I’m just at that point where I've already made it this far so I better just stick with it. \n\nThat’s my main motivation as of right now. This illness has been holding me back from almost everything. I really had some big plans for this year, and last year, and the year before that. Now that we are approaching a new one I can’t help but feel disappointed.  \n\nThe funny thing is I really felt like I had taken such a huge step out of my comfort zone this year. Now I'm distancing myself from everyone again and going back to old habits. The type of habits I haven’t had in years. I can’t seem to figure out where I screwed up. \n\nI’m just so broken. Humans are supposed to be social creatures, but I just can’t seem to let someone in without completely losing myself in them. \n\nWhy do I need this constant reassurance then pretend like I don't give af when I get it. Maybe I’m just overthinking but sometimes I feel like I have this need to have everyone like me. As long as everyone likes me I’ll be okay. They can treat me as bad as they want but if that helps them to like me more then I guess it's worth it to me. \n\nI have a lot of attachment issues and a lot of relationship issues. I think that's where all this bs I’ve been dealing with for the last 15 years stems from.\n\nIdk, lmk what y’all think. Can anyone relate?","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18ipzur\/day_25_ssri_have_people_been_speaking_to_me\/"},{"title":"Just another vent post","text":"After months of counseling and dozens of medications life has only gotten worse.\n\nI have now managed to rack up thousands in medical bills and a lot of debt.  I am basically behind on everything with no hope of recovering.\n\nMy depression has been so bad I have lost all my customers and jobs.  Which in turn feeds my depression. So it is a vicous cycle.  The more I try to get help the worse my situation gets.\n\nThe doctors want to commit me now, which in turn only makes my situation worse.  The argument of \"but you will get the help you need\" doesn't account for the fact that it also will ruin my life more with crippling debt.  Who is going to pay for it all?  Surely not the doctors and counselors.  They only take my money every week.\n\nI am to the point that I hope and pray everyday for me to be taken out by a bus, truck, or anything that will pay my family.  But no one in my life understands, and no amount or type of medication can fix this.\n\nI am done with life but unfortunately life still enjoys kicking me while I am down, amd beating me way past submission.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18ib60n\/just_another_vent_post\/"},{"title":"how did it get worse","text":"It somehow got worse from my last post. every thing seems to go wrong weather it be school or a personal project. I can't seem to please my parents or my siblings I don't have time to hang out with friends because I'm doing everything else for my parents and sisters and when I say no to them my sister complain and tell my parents I called them the B or C word even though all I said was no to something they could do. I'm 16 I personally don't think I should know how to redo an entire bathroom including shower\/tub, toilet, and sink, I shouldn't know how to tear a washer apart and put it together correctly I shouldn't know how a house's pipes for water and heat work I shouldn't know how to fix the most random things. I started learning this stuff at 10 by 13 I new how to do most of it now i can do it without help. For some reason my dad is forcing me to learn how a bus's electric system works and how to fix them I don't know why but I feel like a slave to my family. Today I stayed home from school because it's the anniversary of a friends death and all I heard today from my parents was how I needed to stop missing school and how I need to man up and learn to deal with things. I'm just tired of being walked on and treated like I don't matter by my family. The only people who know how my mental state is are my friends who treat me more like family than my actual one but who knows maybe my parents and sisters are right maybe all im useful for is their dirty work because their lazzy","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18h52n2\/how_did_it_get_worse\/"},{"title":"Why even try if everything gets worse","text":"Like the title says, for the past two years its just been tragedy after tragedy. I lost my apartment due to a relationship issue. Terrible toxic relationship where I would move in and out a couple times. Right now I am at my parents with no room or anything. I had to drop a class because my mental health is so poor this semester and it sucks because school was keeping me going. I am so tired, I can't be happy and I can't even cry even though I feel them coming. I am just so numb, I hate that i've been sad for more than half my life. I started taking meds at 11 or so. I am surprised I haven't killed myself yet and of course the bad people get rewarded as well. I've lost a couple jobs because of shitty bosses. I am so thankful I have a job rn and it's looking good bc management is actually nice but otherwise I have nothing to do outside of work and school. I am a loner, nobody to talk to because my parents are not the approachable type. I wish I had friends. I envy the people I see walk into my cafe that have people that care about them whether that be friends, a couple, family. I wish I had good things happen to me. I wish I still had hobbies. I wish I was okay. ","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18gapc8\/why_even_try_if_everything_gets_worse\/"},{"title":"Im the guy she looks for if the room was empty, while she’s the girl I’d look for in a full room.","text":"Quick context: met a year ago, shared same values and mindset, we secretly fell for each other without confessing, but we both know it’s true. Texted each other every single day on almost everything. I’m a difficulty to know friend, but she broke that barrier and knows me the most, she can tell what’s up with me just from my expressions. She’s always the one to check up on me, and I make sure I do too. We share notes and whatnot.\n\nLately, her attitude towards me changed. Taking longer to reply, sometimes till the next day, seldom shares ig reels anymore, and puts fewer effort to meet. The topics changed, the sincerity changed. And sometimes she makes me feel like I’m the just the other guy, such that if friend X or Z were around, she would choose to talk with them over me. She rarely shares what she up to anymore, and is like distancing herself from me.\n\nIdk man, it hurts. I loved her so much. And probably the most I will ever love. My body chills every time I read her name in my notifications center, and seeing her drift away is killing me slowly.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18b9w28\/im_the_guy_she_looks_for_if_the_room_was_empty\/"},{"title":"A lot of anti-bullying campaigns only talk about \"emotional support\" for victims and not enough about confronting bullies.","text":"A lot of these commercials are very soft. Some of them aren't even about bullying. I remember seeing one about including a person if they seem lonely and then they equated that to bullying as if it's a kid's responsibility to befriend someone. While inclusion is good, that isn't always the solution people want. Some kids, as I have had to learn over the years, will get annoyed if you try to approach them and actually want to be alone. But what bothers me more about these anti-bullying commercials is the way these people are talking about how to handle a situation with bullying. Instead of the idea of confronting a bully if you see it happen, they're talking about supporting the victim afterwards. This non-confrontational solution doesn't do anything. Imagine being bullied whether it's teasing, harassment, or getting beaten up and someone says \"Hey, I saw what happened to you. Are you okay?\" over and over each time it happens instead of actually doing something. A bully doesn't stop bullying simply because they see that their victim has friends. Telling a teacher, assistant principal, principal, or counselor  sometimes works as  adults might do something or unfortunately not do anything. But I can't imagine seeing someone get punked, beaten up, teased, cursed at, and having slurs yelled at them and do nothing until after it's done and then ask the victim if they're okay. Why the fuck would they be? Would I be okay if people just sat there while I'm being teased or beaten up? No. So why are these new commercials about anti-bullying about being passive and not active? A lot of people complain about kids being softer than the prior generations, but it is the prior generations that teach these kids to be soft, which is very ironic. ","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/18a2qde\/a_lot_of_antibullying_campaigns_only_talk_about\/"},{"title":"Day 10\/11 on antidepressants: Had a pretty bad panic attack today.","text":"I blame my OCD. Sometimes I have these episodes where I start to think I'm somebody I'm not. Idk if that even makes sense, I probably sound crazy, it is crazy. Iykyk how it is. \n\nAnyways that happened and I wondered if maybe it was the antidepressants because it was close to my dosage time. I can't be too sure though, but I'll keep taking them and keep an eye on it.\n\nAfter work I picked up a sandwich omw home and after that I passed out. The plan was to eat and then go to the liquor store. I planned on drinking tonight until I felt something. I suppose I still am but I wanted something a little stronger. \n\nIt's not the only reason why I wanted to go to the liquor store. There was somebody I wanted to see on the way there. It didn't happen though and maybe I just need to be more open or maybe I'm just not ready to let anyone in. \n\nI looked at my sleeping habits for the last two months. Every month my Fitbit makes me a report. I haven't really been sleeping as much as I used to. I feel like that may be contributing a lot to my mental well-being, but I'm not quite sure how to fix it.\n\nI bought a lot of books today as well. Hopefully once I get some more work done on my house I'll have the time to read them. I got them all on sale though so I feel good about that.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/188y690\/day_1011_on_antidepressants_had_a_pretty_bad\/"},{"title":"Was having a good day until my parents made me feel like I’m a disappointment.","text":"So this all started a month ago when my mother found one of the sex toys that I had in my closet. My dad told me to hide them because we were having guests over so I did and I didn’t think anything of it. Tonight I learned that they went through ALL of my drawers and found all of my sex toys.\n\nFor reference, I do have a collection of sex toys. They make the primordial sex driven part of my caveman brain happy and do fill me with a bit of a sense of joy when I see them (don’t even have to use them to experience joy).\n\nThey think what I have is excessive, and hearing that really hurt me. It made me feel like a complete freak and a disappointment. \n\nI guess I’m just venting because I’m mad at myself for expecting privacy in my own home when I maybe should have moved out by now (I’m 24 and finished up college in May). I’m mad that I’m not better with finances and haven’t had any motivation to find some place, and I’m mad that my stupid desire to even have sex toys put me in this situation in the first place.\n\nMy parents have been on my ass about stuff the past few months and one of these times I’m going to blow up and just ask them if I’m a disappointment to them or something like that. Doing this guessing game of assuming I am is hurting, if I’m a disappointment, I just wanna know it and move on with my life.\n\nI’ve decided I’m going to try and improve my situation by trying to learn how to suppress the urge to buy stuff (which includes sex toys and also will allow me to get a good amount of money saved up) so I can find a place and move out and not have to deal with them anymore. \n\nI’m still just mad at myself for being such a degenerate. I’m just hoping I can turn my life around.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/1876agb\/was_having_a_good_day_until_my_parents_made_me\/"},{"title":"I really cannot stop thinking about how the blackpill makes sense to me.","text":"The blackpill is the idea that your looks\/genetics are what determine how good or bad your dating life is.\n\nIn blackpill when talking about looks it is in reference to two main things\n\n1. Height\n2. Face [hunter-eyes, jawline, facial symmetry]\n\nThroughout my entire life I never really got signals from girls showing any kind of interest in me \n\nEspecially right now in my mid-20s I'm balding and I'm also short [5'6], literally 0 signs of interest from women. \n\nI do have some female friends but that is mostly it. I never seen any signs from women showing any interest of being attracted to me and wanting to date me.\n\nI thought 5'6 even though I was short I could date girls shorter, but most girls shorter than me have boyfriends who are at least 5'8-5'9\n\nI am trying to self improve and take care of my health and wealth and also trying to look better as well but when I see naturally good looking or taller dudes easily pick up women with MINIMAL effort it makes me so demotivated and depressed.\n\nWhen I see women showing interest in a guy that I never got in my entire life it makes me extremely depressed.\n\nI really do believe that most average looking women are not attracted to average looking guys while other way around is not true. Or else I would've seen way more guys in relationships. Most guys I know are single.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/186zlru\/i_really_cannot_stop_thinking_about_how_the\/"},{"title":"Day 5: My dreams have been continual and full. The past 2 days.","text":"I usually can't remember my dreams or sometimes they just switch to something else before finishing the last. When I hear others talk about their dreams theres so much detail in them. Makes me wonder if like my thoughts my dreams are also constantly racing and switching around, they're also just thoughts after all. \n\nIk it could just be nothing and I did hit the tequila pretty hard before going to sleep, but who knows. 🤷‍♂️ What if my anxiety and depression affects my dreams as well and the antidepressants can help with that? \n\n(My dream)\nI saw my uncle and I can't remember what he said, but Ik it made me sad. It wasn't because of what he said, although it was deep from what I sort of remember, something about parents trying their best. \n\nIt was sad because it's been so long since I've heard his voice that I couldn't even remember if it was his. There was a time long ago when I feared I would forget it and now I guess I have without even realizing. \n\nI saw my brother in my dream too, I missed him yesterday. We got emotional over what my uncle said and started crying. So I gave him the biggest hug. I don't think I've ever given him a hug. \n\nI took him to lunch, where I saw an old friend who I haven't seen in 5 years. We said our hellos and asked each other how we were doing and then he left. \nThe conversation didn't get much deeper. As he walked away I shouted at him to come back, all the eyes in the restaurant drifted towards me. I told him I missed him and that we should go grab lunch and catch up.\n\nAlthough the dream switched locations a lot it all seemed to have the same people and theme.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/183n4cs\/day_5_my_dreams_have_been_continual_and_full_the\/"},{"title":"I hate how I look & my day is ruined","text":"Just got some pictures back from a wedding I was in, hoping to use them for dating apps. I don’t have any current pictures because I hate how I look & I’ve always hated being in pictures. I was hoping dressed up and a professional photographer, they’d look alright and I could start a decent dating profile. \n\nI got a few today and they don’t look good. Instantly put me in a bad mood. Spiraling into negative thoughts and I can’t stop it. Thinking about how an attractive woman would never be attracted to me. How of course I was rejected by the women I’ve asked out before because of the stark difference in appearance. How this one girl I had a huge crush on would literally never be interested. \n\nI’ve tried to work on it, lost a bunch of weight, put a little bit of it back on. Now I notice my eyes look weird, my big nose, goofy looking face. But I’m just intrinsically ugly even if I’m not obese anymore. Doesn’t matter. Never going to look good enough for women. (Before people say looks don’t matter, I’m not black pill bullshit, but they do absolutely matter. You see a person first. Before you can see someone is smart or funny or kind or whatever. If you’re ugly, you don’t even get a chance.)\n\nI try to work on my mental health, but the moment I saw those pictures it’s been shit since. I’ve always hated the way I look. Used to not care, didn’t get me anywhere. Started to care, doesn’t make a difference. Now I do care, and it makes me feel like shit.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/182i0c1\/i_hate_how_i_look_my_day_is_ruined\/"},{"title":"Antidepressants Day 2: yuh I'm fucked up..","text":"It was rough. Got praised again at work . I ask myself if it really even means anything to me. I don't think it does. And if I'm not perfect, then your praise means nothing. \n\nI really do try my best, but to me it feels like nothing. Anyways I don't wanna bring my work home. I'm gonna try harder tomorrow.\n\nI was actually pretty down today. About what? I don't really know. I Just didn't feel good about myself. I miss her. \n\nI still got some bullshit to deal with. I bought myself a couple Christmas presents I'm looking forward too. I received two today. I'm pretty happy with them. I really know what I wanted this year. It shows I care about myself lol. \n\nUghghghhh. ...  I went out to dinner tonight. I finished all of it! I feel sick about myself. It wasn't really that great of food.\n\nI'd have preferred the other restaurant but when I arrived the sign said, \"closed. Out of business\".\n\nA other person's dreams crushed is really all I saw... \n\nThen I came home and finished off this bottle of whiskey. \n\nI'm jamming rn. Got my music blasting before I drift off and wake up to face another day. 😁😁\n\nThanks giving us coming up. Ik for aot of us tomorrow is our last work day! What's your plans????????","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/1810snr\/antidepressants_day_2_yuh_im_fucked_up\/"},{"title":"Day 1: antidepressant progress.","text":"As expected not much change. I will say though that I was a lot more energetic. Perhaps it was the excitement and nervousness of coming back.\n\nToday wasn't bad if I'm being honest but I wish I could change some things. I got praised at work for doing a good job and I felt good, but at the same time I feel like I didn't do enough.\n\nI was in my head a lot today and did get a little emotional and distant at times during my social interactions.  I have been dealing with shitty people who can't do their jobs though, so I haven't really been in a social mood.\n\nI thought a lot about the girl I like. I wish I could see her because texting just isn't the same as when I talk to her. I love that I can speak to her that's one of the things I really like about her. I don't feel judged by her at all. \n\nShe's easy to talk to but not easy to message. Usually it's the opposite with everyone. So I'm not really sure how I feel about that. \n\nAs antisocial as I am I do prefer speaking face to face. Perhaps it's the ability to read people and see their reactions in real time. \n\nI cooked dinner tonight for myself. As usual I can't finish the plate even though it's not a lot. I said I was gonna cook more tonight too but I'm tired. It was gonna be a dessert.\n\nAs of rn I'm considering drinking but I don't think I will. I'm trying to quit. Really I'm just trying to get up and take a shower. I feel like there's a thousand pounds on me. \n\nWell, I think that's really all I have to say for  tonight. Hopefully no weird dreams tonight and I can get through without waking up four times.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/1806tcw\/day_1_antidepressant_progress\/"},{"title":"I can't take flat affect anymore","text":"Not having my emotions is destroying me. I've become a robot whose agony is slightly supressed by the sertraline which have upped in dose. Because i cant feel my emotions, i cant feel music, my one true joy on the planet. It just sounds like additional noise stimuli, not music anymore. I just want music back. Is it because i had a year long psychosis that progressed to schizophrenia and im just dealing with the aftermath of that? Is it because flat affect is something you can't remove from schizophrenia? Is it because of the bad reaction i had to the invega shots first time round? (Thats when it all started to be fair) i just want my feelings back and i won't rest until i get my emotions back. I will find a way, im hoping this is temporary, ive been doing good so far, I'm going to the gym, eating healthy, seeing friends, my positive symptoms have lessened greatly. Maybe i should just ask to lessen the dose once i gey changed to abilify. Just hoping one little nudge of the meds is all it takes. Hope my psychotic episode last summer was a one off. I think it could be- i had a lot of stress at the time. Pray to the higher powers. Rant over","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17yjpg7\/i_cant_take_flat_affect_anymore\/"},{"title":"I wish to experience love","text":" \n\nHello, I'm 21 years old and all my life, I've been trying to be the best version of myself and make my parents prouds.\n\nI worked hard in school, I did my best to succeed in my studies and, after years of mental tortures, I'm now in second year of med school. I enrich my mind by learning new languages, reading philosophy and history books. I take care of my body, I hit the gym every weeks, sometimes with my friends, I avoid fast foods, I get nice haircuts, perfume myself etc...\n\nI have never been loved by a single girl and it's shattering me. Since High School, I found myself as the only guy with absolutely no experience with women. At this age, every friends I knew were in couple.\n\nI can't help but comparing myself with others, how come everyone succeed but not me? How am I different from other people? What did I do wrong in life to be different like this?\n\nThere has to be an explanation since it's been this way for many years now and I never even held hands with a girl. In response, I began to question my value as a man and to feel insecure about my body and it's unhealthy. I'm starting to feel insecure about my height being 5'5, I'm starting to hate my body in general but I do my best to look confident on the outside.\n\nMany people say to guys like me to just let it be and that it will happen one day. I don't think so, life is a competition. If I continue to live like this and change nothing, statistically speaking, I feel like I'm following the path of a futur 30 years old virgin.\n\n(I want to clarify that I do not treat women like aliens, I have had several female friends in my life that I like and I know how to talk to them.)","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17w7b59\/i_wish_to_experience_love\/"},{"title":"Dating apps (tinder & hinge) has absolutely destroyed any sense of self worth and made me completely suicidal.","text":"title says it all really. I've always been quiet shy, never had any attention from opposite sex growing up, I know I'm ugly but never truly understood it's this bad.\n\nThe experience of trying to put myself out there for the first time ever was a disaster. I had one match and her reply was 🤢 then unmatched me.  I guess her friend matched me for a prank.\n\nNo likes, nothing else. Not a single message about anything, I have achieved a decent amount in my 24 years alive, masters degree, chess and pool championships, I make average money for my age around $50k, came from poverty but the worst is my looks. \n\nand no I'm not expecting to be a model and have any woman I want, I like the idea of someone genuinely liking my company, and I enjoy theirs, that's it. \n\nThe requirements are like a never ending Stairmaster. I suppose my genetics deserve this, they deserve to die out because of how bad they are. \n\nI've decided getting wealthy is my goal but this isn't to get women. It's so I can enjoy at least a few things in life like supercars, jet skiing and travel. If it doesn't happen by 30 then I will be exiting life.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17ulb0p\/dating_apps_tinder_hinge_has_absolutely_destroyed\/"},{"title":"Depressed about male disposability","text":"One of the things that’s been in the back of my head for a while now is how male life is valued less than female life in nature. I’m especially referring to war, and how young men who haven’t lived much are expected and even often forced to just throw our lives away to die or get injured in war. Since i’m prime military age (20) it makes me very depressed and uncomfortable knowing my life is worthless enough to just be thrown in the meat grinder if someone decided to start a conflict or if I lived in a different country. I haven’t even benefited from society, I don’t have any support system so I think to die in a war I would be dying for nothing. I don’t have any family of my own or any loved ones to defend. I still live with my parents and my father watches military movies very loud all the time, I asked him what’s the appeal of military movies and he told me war is in our blood as males, and we were meant to fight in wars & war is sometimes good which made me a little sad hearing that from a parent. While i believe fighting in tiny nomadic groups and hunting animals is in our nature, i don’t think we are meant to die in organized meat grinder war. I can’t find much stuff online about other men feeling depressed & sad thoughts about this, nor have I ever really heard about men talking about this being depressing. so I think I have a very niche opinion and I’m a small percentage who gets very sad and about these unchangeable inescapable cruel biological realities of nature and realities of life","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17tekdo\/depressed_about_male_disposability\/"},{"title":"In a strange place (mentally)","text":"I don't really know where to start this because I'm in such a weird head space right now. I've been bullied most of my life, all through school (with some breaks in between grades) and well into the work place. From my 20's to maybe mid 30's I was in a very dark place. Slowly, I've started to make improvements in my life. It's been a gradual change but a much needed one. I'm happy to say that in my 40's I'm in a happier place then ever before. Or at least I thought I was...\n\n&#x200B;\n\nHaving been bullied for so long I developed Social Anxiety and low self confidence. Again, I've slowly improved over the years, and even kissed a girl for the first time at 38, something I never thought would happen in my lifetime. \n\n&#x200B;\n\nI currently have a woman in my life who I love dearly. When I'm with her my Social Anxiety is just gone, and I know that she'll accept me just as I am. She's the only person I've ever felt that way with. Her and I aren't dating (she's just done with dating after dealing with her own shit) and I can respect that. I'm a little disappointed sure but I still love her, and I still get to spend time with her, and while I have no expectation that it'll happen, people change their minds all the time. \n\n&#x200B;\n\nI'm happier than I've ever been. Yet I feel so lonely and depressed lately like nothing has changed. It's just so frustrating and confusing. I thought I was getting better, so why do I feel worse? I just feel so helpless and I hate feeling this way when by all accounts I am better. \n\n&#x200B;\n\nI just keep coming back to that. I'm in a better place, so why am I sad? I just can't come up with anything. I'm hoping by writing it all out I can start to heal a bit. I'd love to hear your thoughts though.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17t3x6j\/in_a_strange_place_mentally\/"},{"title":"I am incredibly lonely, but feel I am not motivated to change it.","text":"For some context, I am a senior in HS, always kinda been a loner and the one group that I was well connected with I have either burnt bridges with or they are graduated and on to bigger and better things. I am a wrestler, but I don't fit in with the team all that well, and I have been continuously trying to better myself. I have dated several girls, none of those relationships have worked out long term though, and I made a major fuck up by handing away the v card in my last relationship. I was also an asshole at times, though I have mostly moved past my blunders, and have tried to improve myself. \n\nMore or less I just do not see a point in socializing outside of the bare minimum. I don't like the idea of single serving friends, and am aware that most of the connections I make in the next 7ish months will ultimately amount to very little outside of maybe some good highschool memories. It just doesn't feel worth it to me, but at the same time I am incredibly lacking in any form of intimacy or human connection with my peers. \n\nI have nobody to really share most of the things rattling around in my head with as my parents are both out of touch gen xers who had 0 libido until the age of 25, I am not close enough with my siblings to talk about this stuff with, and I have no 2nd family. This is my conundrum. ","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17rxqqq\/i_am_incredibly_lonely_but_feel_i_am_not\/"},{"title":"Envy","text":"I feel like I tend to be envious of people at a certain extent. whenever I see a parent and a child bond together; or a friend of mine succeed cause there was someone their for them; or even as small as them not having to worry about anything while going out. And just having fun & going to events.\nI still remember the day in grade 7. During results my friend was looking at his mom. And just by the gaze alone I could tell that she would love him dispite anything. We where both special needs kids I only found out later what was wrong with me . By going yo therapist by myself. But I just wish that my brain would shut up. and the first thing that pops into my head is \"man I can never have something like that.\" \n\nI am always worried about what's the next thing I have to do. What's an excuse I have to make to justify being out here. I felt guilty that I didn't have money most if the time. I couldn't take my girlfriend out on dates. now we are broken up. Cause she could not do it anymore. I wish I could just not be worried when I was happy. In my brain there is a voice going that everything is going to fall apart when I am happy and it has fallen apart. I don't have any friends or anyone I am close to me. My ex just moved to USA  and broke up the first chance she got and said that I am the reason for all my problems. And she would have stayed if I had stoped being so negative all the time. I don't know I wish I could learn to just let go and be happy.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17pt84p\/envy\/"},{"title":"Anyone else have it the worst out of their friends\/family?","text":"They say comparison is the killer of happiness, but goddammit is it hard not to when it comes to the people you spend the most time around.\n\nI’m not gonna sugarcoat it, my life from birth to now has been hell. This post would be a novel if I got into the specifics. My friends and family have had some shit go on in their lives too, but seemingly not to the merciless degree I have. They haven’t gone through the financial struggle, abusive childhood, and many of the specific shit I’ve had to endure… and I don’t want them to. It just sucks feeling like the “unlucky fuck” of my circles and feeling alone in this bullshit.\n\nLike I’m the one God decided to make an example of to my friends that “remember guys, your lives might be hard but at least you’re not *insert my name*”. I wanna be happy for my friends when they succeed but lately it’s been hard internally. While I was going through the hell this year with my parents, car, home, and ofc girl problems my close friend was having a threesomes with women enjoying life… and he wouldn’t stop FUCKING BRAGGING ABOUT IT!\n\nI truly feel cursed. I really do.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17pigzo\/anyone_else_have_it_the_worst_out_of_their\/"},{"title":"I don't like life alone, but I also don't like changing to be someone people want to be with so I hate my life.","text":"Hello, I wanted to know if there are other people in my boat. I live alone in a 1  bedroom apartment, where I work from home, and mostly sit on PC. I do not have social skills, nor do I like cleaning or organizing. I can cook for myself, and I do bare minimum cleaning and laundry, but everything is messy. Guys are ok with my apartment, but girls hate it. I feel that's the lifestyle that makes me happy, but I want to be with a woman too, but I know, accept, and understand why many women wouldn't want to be with me. I am still not happy, nor do I see I will be happy if I changed my entire life just to get a partner, so in the end I wish I was never born sometimes because all the options are bad. I do not begrudge women for not wanting someone who lives as me. I am a virgin by the way. The point is am upset at life, cause there is no life style I can be happy with.\n\n&#x200B;\n\nI also feel resentment that women don't need us as much as we need them, because I do not have anything to offer that they want, but I need them to be happy. Again this does not lead me to hating women, or wanting their rights going away, just it makes me feel life doesn't have the components I need for me to be happy.\n\n&#x200B;\n\nI also read a lot of women saying that men don't actually like women but want to use them, but the way I feel is I cannot even afford to think whether I like a woman or not because I need them. Like there isn't a good way to give this example, but let's say there is one police man and you liked him but there is a criminal nearby, if you liked him you wouldn't want him to go in danger to fight the criminal, but because your need of him triumpths you liking him, then you want to use him first.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17jdn5t\/i_dont_like_life_alone_but_i_also_dont_like\/"},{"title":"Being a man with low self esteem is awful.","text":"I had a neglectful family. Parents who didn't love each other. An abusive father. Bullied at school. Dad shouted at me when he found out I was getting bullied so I just hid it. As time went on, I just became better at hiding it. I would become over confident in my personality and sometimes a bully. But it just gets worse and worse. As I go deeper into adulthood I see the myriad of ways that it ruins my mental health. I struggle to stand up to myself which leads to further trauma. I am terminally depressed about not finding a partner but too shy and beaten to attract anyone. Life just seems completely empty and hopeless and I don't see the point in anything. No matter what I accomplish, it's never enough. \n\nI've sculpted my body to the point where people comment on it. I've taught myself several languages. I go to therapy and I've got a good career. I've got a good career. But I can't pull myself out of this. I don't have the resources to fix myself. I was never shown love as a child. I can't pull it out of nowhere and love myself now. I've reached such a low point I have no idea what to do. ","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17iav40\/being_a_man_with_low_self_esteem_is_awful\/"},{"title":"I’m Tired Of Fighting Guys But Thanks For Trying","text":"Hey guys. I’ve posted here before from another account that I deleted. I’m 23 now, been dealing with suicidal thoughts since Kindergarten. And y’all have been making this so much easier by responding to my posts. And tbh I think I’ve been doing good the last few years. I landed a job as a car salesman. I was pacing about 77k a year before my dealership shut down. I’m still in the car industry but I realized that I was doing “baby” car sales.\n\n I was a glorified order taker who made money selling car warranties. Now I’m at a real car dealership and I’m struggling. I’m drowning in debt. I can’t overcome objections because tbh, I didn’t have to at my last job. Usually the car sold itself and I just had to pitch the warranty well..quite the handicap. I can’t bare the idea of living with a repo on my car. I’m already a failure enough. I failed Marine Corps basic training at 18. I’ve never NOT lived at home. I have 1,000 dollars in my savings account and I really hope that’s enough for my family to bury me. \n\nI’m truly alone. No friends no nothing. I can’t sell a car to save my life and everyone around me is flourishing. I’m too weak. The best I can hope for is I crash my car into something fast as hell and get a “respawn” if you will. If not? Well, it is what it is. But I’m really tired of fighting circumstance. The most I can do is make all this end. \n\nI’ve got this car that I can’t afford anymore. I can’t make money it seems. And I just don’t see a point. I can’t even text my family and tell my them I love them because they’ll get alarmed, that isn’t like me. \n\nSo I guess Im writing this to say thanks guys, and I’m signing off for good. I appreciate all the support and advice I’ve gotten from you guys over the years. ❤️","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17fi77b\/im_tired_of_fighting_guys_but_thanks_for_trying\/"},{"title":"Y’all ever feel like if God exists he hates you?","text":"Like for some odd reason he made you just to suffer as his twisted little entertainment? Like anytime something seemingly good happens in your life he quickly intervenes to make sure that shit doesn’t happen? Like your only purpose is to suffer for him to get a cheap laugh at your expense then die.\n\nThing is I don’t feel like I’m being hyperbolic anymore, I’m starting to genuinely believe this is the case. Everyone goes through stuff, but I’ve been getting hit mercilessly back to back to back this year, really my whole life but this year especially. The kind of bad luck you’d see on cartoons, the kind where if you told people about it they’d think you were exaggerating.\n\nEvery time once I feel like I’m over a hurdle another very serious problem immediately follows. I think suicide is a legit solution in cases like these, your life is already written and is sure to be as fucked up as it’s been so why not. Then again with my luck I’d somehow survive and live out the rest of my days paralyzed. Fuck existing honestly.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17dzcmy\/yall_ever_feel_like_if_god_exists_he_hates_you\/"},{"title":"Being a single accomplished male is a double edged sword","text":"I'm making a good income. I travel a lot and I speak a bunch of languages. I'm fit and I've got a good career and a place all to myself. I can come home and do what I want. If I don't want to talk to anyone I don't have to. I can go out on the weekend get smashed come home and be hungover all day with no responsibilities. My money is my own and I'm going to Sri Lanka on my own tonight. I've got no stress save my job. \nSo many men would kill to be in my position. I've made it and I'm so grateful. I wouldn't want anything to change as I love my free time and my hobbies. I'm a young man with the world at my feet and I feel like I'm in the best years of my life. But I still get lonely. I look at happy couples and I get sad. I've started unfollowing women on insta. I wake up from dreams where I meet someone. However, I remind myself of the positives I have now that I'd lose when in a relationship, and it's a mix of sadness but also a feeling of safety. With a wife or a gf, you're guaranteed stress but with company. On your own, you know you'll be alone but you'll be safe and things are predictable. \nFor the first time I've genuinely wondered whether relationships are worth breaking my peace. I used to be so desperate for love, still am, but I now value my peace. Its a double edged sword. I'm lonely, but I'm at peace. Once you reach your late 20's, it's sort of forces you to learn this.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17cz18m\/being_a_single_accomplished_male_is_a_double\/"},{"title":"My mind is actually killing me atp","text":"I have this weird disconnect in my mind that makes some people just not seem real. Especially the people closest to me like my mom and my grandmother, they just don't feel like they exist sometimes. It's like I'm not actually in my body or my mind. Kind of like I'm living someone else's life, but the entity (me) that is living that person's life doesn't exist either. Like I'm living someone else's life, but I'm also just empty space at the same time. I don't even know how to describe it. I'm a normal person, mostly extroverted, decent amount of friends, etc., but somehow I feel like this. I don't know if it's a side effect of me literally staying in my room at my grandparents house for like a year and a half from the start of Covid through a chunk of 2021, only coming out of my room to eat once a day, laying on the same bed for 23 hours talking to people on Xbox I wasn't supposed to, a sleep schedule that was from like 9am-2pm and repeat, from the ages of like 12-13. I know for a fact that time completely screwed up my mental processes maybe beyond repair, but I don't know if it caused this or if it's just something else. But people, even friends and family, just don't feel real. My mom hurts the most, because she's a single mom and a nurse, she works 4 days a week for me, and loves me more than anything. At the same time she feels like a stranger most of the time, like she doesn't actually exist. This is something I been struggling with for so long and I've made so many mistakes because of it, and it hurts like hell talking about it. I don't know what this is and I've never seen anyone similar, so i don't even know what i'm saying anymore.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/174f5o1\/my_mind_is_actually_killing_me_atp\/"},{"title":"I feel nobody wants to see how much I'm trying","text":"I'm (27M) so tired of people comparing me, or telling me I'm not doing well enough for my age, and I honestly don't feel it's true but whether it's my ex or my parents I think they just don't see my hardships. I started my clothing label when I was in my final year of college and took up a job once I graduated I did both at the same time I used to work from 9 am - 10-10:30 pm and after covid I resigned from the job and started completely focusing on my work. I haven't taken any investment or anything from my parents or anyone. I have never done anything with people of my age did. Mostly everything goes to business. \n\nI have a small production house, I have to pay my salary to my master tailor, rent for my office rent for my apartment. Right now I don't have any savings. My mental health has been in crisis for the last year and it has affected my work, to meet every cost I was vacated from my apartment and moved in with my rent (this was my last option). Everyone keeps asking me to get a 9-5 job. if I take a job, whatever hard work I have done for my brand will go to waste and in Indian fashion industry doesn't pay well for a desk job. \n\nRight now I really wanna help myself with my mental wellbeing but all these make it worse.i don't have any friends or gf and right now I'm standing at point where I feel the entire world is trying to fuck me up despite my every effort. I truly believe in myself I can make my label work and there is growth, people love my work. But it's heartbreaking when you don't have anyone to believe in you","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/172t3tr\/i_feel_nobody_wants_to_see_how_much_im_trying\/"},{"title":"I feel like I’m slowly growing into an angry bitter person","text":"I’ve withstood a lot of bullshit in my life from childhood to adulthood and usually I’m able to smile it away and distract myself with some form of silly entertainment. Recently my anger had started to slowly build over time as more and more obstacles keep getting recklessly thrown at me left and right. This year especially (for anyone that’s read my other posts here) has really tested my fucking patience and sanity. Never ending bullshit after bullshit after fucking bullshit with no sign of a goddamn break.\n\nAt work I feel like I’m one shitty customer away from a potential assault charge. It’s gotten to the point where I’m almost anticipating someone fuck with me so I can let all these years of anger and problems out. There’s times I just wanna scream in my car and bash the wheel but that would be another problem added to my fucked up car rn. I wish my luck and fate was personified so I can actually fucking hurt it for all the shit I’ve had to go through.\n\nI hate everything and everyone. Fuck this year and fuck my life.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/17105xq\/i_feel_like_im_slowly_growing_into_an_angry\/"},{"title":"Sick of being stuck between not wanting to live and not wanting to die either","text":"Wish I just hadn't existed to begin with, I don't want to be alive, I don't want to die, I don't want to do anything, I hate everything, I'm bad at everything, I hate the body I was born in, I hate being alone and I can't stand being around people, I want this world to go away, I want to disappear. It feels like I'm slowly going insane, I'm losing my mind, been having more outbursts than usual and scratching myself more than usual to the point I have marks all over my neck and face, and chest, and elsewhere most days, the sounds people make every fucking day are driving me mad, I can't even look at other people without being so utterly envious I want to immediately stab myself, I can't go into public without getting anxious, I can't show my face, I don't understand how to interact with others, what the fuck does this world want from me, why the fuck did it make me, fuck you. It feels like people just hate me for some fucking reason and are just waiting for each of my unending fuck-ups so they could make fun of me, it feels like I'm constantly spied on, like my thoughts are getting broadcasted and everyone's making fun of me for what a fucking loser I am, like it's my fucking fault, I didn't fucking choose to be born, go fuck yourselves, I fucking hate you, fuck you, go die.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/16zsu2s\/sick_of_being_stuck_between_not_wanting_to_live\/"},{"title":"Worst month of my life","text":"(60m,veteran) So this has been the absolute worst month of my life.  My PSA levels have been trending up, so they did a biopsy.   Yeah, I have stage 1 prostate cancer. Gleason 3+3.   But the biopsy itself has screwed up my \"equipment\".   Climaxes just peter out.   Treatment?  We're just gonna monitor it until it moves to stage 2 or 3.  Next, I have two spots removed off my back.  Yep.  Skin cancer.  So I go back in a few weeks for a full body evaluation. \n\nSo where is my support group?  I'm glad you asked.   You see, my wife is fighting stage 4 breast cancer.  Since 2015.  I'm supposed to be her support.  And right now her blood work is all out of whack.  Her scans are clean, but cancer markers are through the roof.  Her oncologist is baffled and concerned.  So we're dealing with that, and get hit with my health issues. \n\nAnd yesterday, after another failed attempt at intimacy,  while discussing the possible reasons, I get told I don't really have cancer, because I'm not going through chemo or radiation  treatment yet.  Really?  SMDH.  FML.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/16yu3uj\/worst_month_of_my_life\/"},{"title":"I haven't felt well in years","text":"I am 15 years old and so far my life has been total hell. I have struggled so much through so much trauma and in my thoughts I hide it with seeing my self as an adult in a child's body. I have lived so trashy. I sleep on a damn couch. School is draining my sanity every day.\n\nSo many people tell me I have it easy. So many people think of me as tough. But in reality I am a sensitive child with anger issues. Yeah I do exercise with my father but that doesn't change shit about my life.\n\nI don't know why or how but for some damn fucking reason I have not been sent into a psych ward yet. For some fucking reason I am still in this same fucking house sleeping on that same fucking couch in the same school, in the same routine, in the same sleep cycles, in the same shit.\n\nI would rather be homeless than spend another fucking day in this shithole you call a \"life\". It is not even a life, it's just existence. I just want to smoke a  damn fucking joint and take a fucking break but I have never even touched a single gram of weed in my life. \n\nIf I ever wind up 6 feet deep you can bet it was by my own terms. I am so fucking tired.","url":"https:\/\/www.reddit.com\/r\/malementalhealth\/comments\/16yyyou\/i_havent_felt_well_in_years\/"}]